
# State **`s3://infrahouse-aws-control-303467602807/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |   🟡 Change |    Destroy |
|:---------:|--------:|-----------:|-----------:|
|     ✅     |       5 |          1 |          0 |
## Affected resources by action

|  Action  | Resources                                                                         |
|:--------:|:----------------------------------------------------------------------------------|
|    🟢     | `module.cloud-init-tester.aws_iam_policy.pytest-permissions`                      |
|    🟢     | `module.cloud-init-tester.aws_iam_policy.role-permissions`                        |
|    🟢     | `module.cloud-init-tester.aws_iam_role.role-tester`                               |
|    🟢     | `module.cloud-init-tester.aws_iam_role_policy_attachment.role-permissions`        |
|    🟢     | `module.cloud-init-tester.aws_iam_role_policy_attachment.role-pytest-permissions` |
|    🟡     | `aws_iam_role.omnibus`                                                            |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_role.omnibus will be updated in-place
  ~ resource "aws_iam_role" "omnibus" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Principal = {
                          ~ AWS = [
                                "arn:aws:iam::990466748045:user/aleks",
                              - "AROAXFXZRL24D5JYG6IBW",
                              + "arn:aws:iam::493370826424:role/infrahouse-toolkit-github",
                            ]
                        }
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "omnibus"
        name                  = "omnibus"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # module.cloud-init-tester.aws_iam_policy.pytest-permissions will be created
  + resource "aws_iam_policy" "pytest-permissions" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "pytest-permissions"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutBucketTagging",
                          + "s3:GetBucketTagging",
                          + "iam:TagRole",
                          + "iam:TagPolicy",
                          + "ec2:DescribeRegions",
                          + "dynamodb:TagResource",
                          + "dynamodb:ListTagsOfResource",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
    }

  # module.cloud-init-tester.aws_iam_policy.role-permissions will be created
  + resource "aws_iam_policy" "role-permissions" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "cloud-init-tester-permissions"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sts:GetCallerIdentity"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
    }

  # module.cloud-init-tester.aws_iam_role.role-tester will be created
  + resource "aws_iam_role" "role-tester" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::990466748045:user/aleks"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-cloud-init:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role to test module infrahouse/terraform-aws-cloud-init"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cloud-init-tester"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + unique_id             = (known after apply)
    }

  # module.cloud-init-tester.aws_iam_role_policy_attachment.role-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-permissions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "cloud-init-tester"
    }

  # module.cloud-init-tester.aws_iam_role_policy_attachment.role-pytest-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-pytest-permissions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "cloud-init-tester"
    }

Plan: 5 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
::debug::Terraform exited with code 0.
::debug::stdout: data.aws_iam_policy_document.ih-tf-aws-control-303467602807-read-only-assume: Reading...%0Adata.aws_iam_policy_document.omnibus-assume: Reading...%0Adata.aws_iam_policy_document.state-bucket-tester-permissions: Reading...%0Adata.aws_iam_policy_document.ih-tf-ih-cicd-control-assume: Reading...%0Adata.aws_iam_policy_document.ih-tf-aws-control-303467602807-read-only-assume: Read complete after 0s [id=2899629952]%0Adata.aws_iam_policy_document.omnibus-assume: Read complete after 0s [id=2101509072]%0Adata.aws_iam_policy_document.service-network-tester-permissions: Reading...%0Adata.aws_iam_policy_document.state-bucket-tester-permissions: Read complete after 0s [id=4028506576]%0Adata.aws_iam_policy_document.ih-tf-ih-cicd-control-assume: Read complete after 0s [id=1154989936]%0Adata.aws_iam_policy_document.service-network-tester-permissions: Read complete after 0s [id=3837005140]%0Aaws_ec2_serial_console_access.console-ue2: Refreshing state... [id=us-east-1]%0Aaws_ec2_serial_console_access.console-ue1: Refreshing state... [id=us-east-1]%0Amodule.debian-repo-tester.data.aws_iam_policy_document.pytest-permissions: Reading...%0Amodule.pypiserver-tester.data.aws_iam_openid_connect_provider.github: Reading...%0Amodule.github-role-tester.data.aws_iam_openid_connect_provider.github: Reading...%0Amodule.kibana-tester.data.aws_iam_policy_document.pytest-permissions: Reading...%0Adata.aws_iam_policy.read-only-access: Reading...%0Amodule.elasticsearch-tester.data.aws_iam_policy.administrator-access: Reading...%0Amodule.kibana-tester.data.aws_iam_policy.administrator-access: Reading...%0Adata.aws_iam_policy.administrator-access: Reading...%0Amodule.github-role-tester.data.aws_iam_policy.administrator-access: Reading...%0Aaws_iam_policy.TwinDBTestRunner: Refreshing state... [id=arn:aws:iam::303467602807:policy/TwinDBTestRunner]%0Amodule.debian-repo-tester.data.aws_iam_policy_document.pytest-permissions: Read complete after 0s [id=438533710]%0Amodule.kibana-tester.data.aws_iam_policy_document.pytest-permissions: Read complete after 0s [id=438533710]%0Aaws_ssm_parameter.gh_secrets_namespace: Refreshing state... [id=gh_secrets_namespace]%0Amodule.gha-admin-tester.data.aws_iam_policy_document.pytest-permissions: Reading...%0Amodule.gha-admin-tester.data.aws_iam_policy_document.pytest-permissions: Read complete after 0s [id=438533710]%0Aaws_iam_policy.service-network-tester-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/service-network-tester-permissions]%0Amodule.github-role-tester.data.aws_iam_openid_connect_provider.github: Read complete after 0s [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]%0Amodule.elasticsearch-tester.data.aws_iam_policy_document.role-permissions: Reading...%0Amodule.pypiserver-tester.data.aws_iam_openid_connect_provider.github: Read complete after 1s [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]%0Aaws_ec2_serial_console_access.console-uw1: Refreshing state... [id=us-west-1]%0Amodule.elasticsearch-tester.data.aws_iam_policy_document.role-permissions: Read complete after 0s [id=1367345401]%0Amodule.github-role-tester.data.aws_iam_policy_document.role-permissions: Reading...%0Amodule.github-role-tester.data.aws_iam_policy_document.role-permissions: Read complete after 0s [id=3418751069]%0Amodule.cloud-init-tester.data.aws_iam_policy_document.role-permissions: Reading...%0Amodule.cloud-init-tester.data.aws_iam_policy_document.role-permissions: Read complete after 0s [id=1367345401]%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-permissions: Reading...%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=3133841775]%0Amodule.pypiserver-tester.data.aws_iam_policy_document.pytest-permissions: Reading...%0Amodule.pypiserver-tester.data.aws_iam_policy_document.pytest-permissions: Read complete after 0s [id=438533710]%0Aaws_iam_role.omnibus: Refreshing state... [id=omnibus]%0Amodule.elasticsearch-tester.data.aws_iam_openid_connect_provider.github: Reading...%0Adata.aws_iam_policy_document.pytest-permissions: Reading...%0Adata.aws_iam_policy_document.pytest-permissions: Read complete after 0s [id=438533710]%0Amodule.jumphost-tester.data.aws_iam_openid_connect_provider.github: Reading...%0Amodule.elasticsearch-tester.data.aws_iam_openid_connect_provider.github: Read complete after 0s [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]%0Amodule.kibana-tester.data.aws_iam_policy_document.role-permissions: Reading...%0Amodule.kibana-tester.data.aws_iam_policy_document.role-permissions: Read complete after 0s [id=1367345401]%0Amodule.debian-repo-tester.data.aws_iam_policy_document.role-permissions: Reading...%0Amodule.debian-repo-tester.data.aws_iam_policy_document.role-permissions: Read complete after 0s [id=2420075302]%0Amodule.jumphost-tester.data.aws_iam_openid_connect_provider.github: Read complete after 0s [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]%0Amodule.ecs-tester.data.aws_iam_policy_document.pytest-permissions: Reading...%0Amodule.ecs-tester.data.aws_iam_policy_document.pytest-permissions: Read complete after 0s [id=438533710]%0Amodule.jumphost-tester.data.aws_iam_policy.administrator-access: Reading...%0Amodule.website-pod-tester.data.aws_iam_policy_document.role-permissions: Reading...%0Amodule.website-pod-tester.data.aws_iam_policy_document.role-permissions: Read complete after 0s [id=1538222225]%0Amodule.gha-admin-tester.data.aws_iam_policy_document.role-permissions: Reading...%0Amodule.gha-admin-tester.data.aws_iam_policy_document.role-permissions: Read complete after 0s [id=3247938485]%0Amodule.elasticsearch-tester.data.aws_iam_policy_document.pytest-permissions: Reading...%0Amodule.elasticsearch-tester.data.aws_iam_policy_document.pytest-permissions: Read complete after 0s [id=438533710]%0Amodule.infrahouse-omnibus-cache.aws_s3_bucket.omnibus-cache: Refreshing state... [id=infrahouse-omnibus-cache]%0Amodule.debian-repo-tester.data.aws_iam_policy.administrator-access: Reading...%0Amodule.debian-repo-tester.data.aws_iam_openid_connect_provider.github: Reading...%0Amodule.debian-repo-tester.data.aws_iam_openid_connect_provider.github: Read complete after 0s [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]%0Amodule.pypiserver-tester.data.aws_iam_policy_document.role-permissions: Reading...%0Amodule.pypiserver-tester.data.aws_iam_policy_document.role-permissions: Read complete after 0s [id=1367345401]%0Amodule.website-pod-tester.data.aws_iam_openid_connect_provider.github: Reading...%0Amodule.website-pod-tester.data.aws_iam_openid_connect_provider.github: Read complete after 0s [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]%0Amodule.jumphost-tester.data.aws_iam_policy_document.role-permissions: Reading...%0Amodule.jumphost-tester.data.aws_iam_policy_document.role-permissions: Read complete after 0s [id=1995204009]%0Amodule.infrahouse_com.aws_route53_zone.ci_cd_infrahouse_com: Refreshing state... [id=Z06790082OU0POPWOCPZ4]%0Aaws_iam_role.ih-tf-aws-control-303467602807-read-only: Refreshing state... [id=ih-tf-aws-control-303467602807-read-only]%0Amodule.jumphost-tester.data.aws_iam_policy_document.pytest-permissions: Reading...%0Amodule.jumphost-tester.data.aws_iam_policy_document.pytest-permissions: Read complete after 0s [id=438533710]%0Amodule.ecs-tester.data.aws_iam_openid_connect_provider.github: Reading...%0Adata.aws_iam_policy.administrator-access: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.gha-admin-tester.data.aws_iam_openid_connect_provider.github: Reading...%0Amodule.elasticsearch-tester.data.aws_iam_policy.administrator-access: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.cloud-init-tester.data.aws_iam_policy.administrator-access: Reading...%0Amodule.gha-admin-tester.data.aws_iam_policy.administrator-access: Reading...%0Amodule.kibana-tester.data.aws_iam_policy.administrator-access: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.ecs-tester.data.aws_iam_policy_document.role-permissions: Reading...%0Amodule.ecs-tester.data.aws_iam_policy_document.role-permissions: Read complete after 0s [id=1367345401]%0Amodule.pypiserver-tester.data.aws_iam_policy.administrator-access: Reading...%0Amodule.github-role-tester.data.aws_iam_policy.administrator-access: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.github-role-tester.data.aws_iam_policy_document.pytest-permissions: Reading...%0Amodule.ecs-tester.data.aws_iam_openid_connect_provider.github: Read complete after 0s [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]%0Amodule.github-role-tester.data.aws_iam_policy_document.pytest-permissions: Read complete after 0s [id=438533710]%0Aaws_iam_role.ih-tf-cicd-control: Refreshing state... [id=ih-tf-cicd-control]%0Aaws_iam_policy.state-bucket-tester-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/state-bucket-tester-permissions]%0Amodule.gha-admin-tester.data.aws_iam_openid_connect_provider.github: Read complete after 0s [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]%0Amodule.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]%0Adata.aws_iam_policy.read-only-access: Read complete after 1s [id=arn:aws:iam::aws:policy/ReadOnlyAccess]%0Amodule.kibana-tester.data.aws_iam_openid_connect_provider.github: Reading...%0Amodule.website-pod-tester.data.aws_iam_policy.administrator-access: Reading...%0Amodule.cloud-init-tester.data.aws_iam_policy_document.pytest-permissions: Reading...%0Amodule.cloud-init-tester.data.aws_iam_policy_document.pytest-permissions: Read complete after 0s [id=438533710]%0Amodule.ecs-tester.data.aws_iam_policy.administrator-access: Reading...%0Amodule.kibana-tester.data.aws_iam_openid_connect_provider.github: Read complete after 0s [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy.admin: Reading...%0Aaws_iam_user.twindb_test_runner: Refreshing state... [id=twindb_test_runner]%0Amodule.jumphost-tester.data.aws_iam_policy.administrator-access: Read complete after 0s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.cloud-init-tester.data.aws_iam_openid_connect_provider.github: Reading...%0Amodule.website-pod-tester.data.aws_iam_policy_document.pytest-permissions: Reading...%0Amodule.website-pod-tester.data.aws_iam_policy_document.pytest-permissions: Read complete after 0s [id=438533710]%0Amodule.debian-repo-tester.aws_iam_policy.pytest-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/pytest-permissions20231109161344894400000002]%0Amodule.debian-repo-tester.data.aws_iam_policy.administrator-access: Read complete after 0s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.kibana-tester.aws_iam_policy.pytest-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/pytest-permissions20240218030459295800000001]%0Amodule.cloud-init-tester.data.aws_iam_openid_connect_provider.github: Read complete after 0s [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]%0Amodule.gha-admin-tester.aws_iam_policy.pytest-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/pytest-permissions20231230002704496000000002]%0Amodule.github-role-tester.data.aws_iam_policy_document.role-trust: Reading...%0Amodule.github-role-tester.data.aws_iam_policy_document.role-trust: Read complete after 0s [id=1596990781]%0Amodule.pypiserver-tester.data.aws_iam_policy_document.role-trust: Reading...%0Amodule.pypiserver-tester.data.aws_iam_policy_document.role-trust: Read complete after 0s [id=2030660215]%0Amodule.elasticsearch-tester.aws_iam_policy.role-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/elasticsearch-tester-permissions20240205185311166100000002]%0Amodule.github-role-tester.aws_iam_policy.role-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/github-role-tester-permissions20231108005944123200000001]%0Amodule.ih-tf-aws-control-303467602807-admin.aws_iam_policy.github: Refreshing state... [id=arn:aws:iam::303467602807:policy/ih-tf-aws-control-303467602807-github]%0Amodule.pypiserver-tester.aws_iam_policy.pytest-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/pytest-permissions20240220205825275400000002]%0Aaws_iam_policy.pytest-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/pytest-permissions20231009203124555500000001]%0Amodule.elasticsearch-tester.data.aws_iam_policy_document.role-trust: Reading...%0Amodule.elasticsearch-tester.data.aws_iam_policy_document.role-trust: Read complete after 0s [id=1403333534]%0Amodule.kibana-tester.aws_iam_policy.role-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/kibana-tester-permissions20240218030459296000000002]%0Amodule.jumphost-tester.data.aws_iam_policy_document.role-trust: Reading...%0Amodule.jumphost-tester.data.aws_iam_policy_document.role-trust: Read complete after 0s [id=3379059500]%0Amodule.debian-repo-tester.aws_iam_policy.role-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/debian-repo-tester-permissions20231109161344894400000001]%0Amodule.ecs-tester.aws_iam_policy.pytest-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/pytest-permissions20231123162055891900000002]%0Amodule.website-pod-tester.aws_iam_policy.role-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/website-pod-tester-permissions20231123172741961800000002]%0Amodule.gha-admin-tester.aws_iam_policy.role-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/gha-admin-tester-permissions20231230002704495000000001]%0Amodule.elasticsearch-tester.aws_iam_policy.pytest-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/pytest-permissions20240205185311166100000001]%0Amodule.debian-repo-tester.data.aws_iam_policy_document.role-trust: Reading...%0Amodule.debian-repo-tester.data.aws_iam_policy_document.role-trust: Read complete after 0s [id=3736492159]%0Amodule.pypiserver-tester.aws_iam_policy.role-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/pypiserver-tester-permissions20240220205825275300000001]%0Amodule.website-pod-tester.data.aws_iam_policy_document.role-trust: Reading...%0Amodule.website-pod-tester.data.aws_iam_policy_document.role-trust: Read complete after 0s [id=1399241301]%0Amodule.jumphost-tester.aws_iam_policy.role-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/jumphost-tester-permissions20231230203905962200000001]%0Amodule.jumphost-tester.aws_iam_policy.pytest-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/pytest-permissions20231230033000156400000002]%0Amodule.ecs-tester.aws_iam_policy.role-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/ecs-tester-permissions20231123162055891400000001]%0Amodule.ecs-tester.data.aws_iam_policy_document.role-trust: Reading...%0Amodule.ecs-tester.data.aws_iam_policy_document.role-trust: Read complete after 0s [id=869017062]%0Amodule.github-role-tester.aws_iam_policy.pytest-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/pytest-permissions20231108003946028700000002]%0Amodule.cloud-init-tester.data.aws_iam_policy.administrator-access: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.gha-admin-tester.data.aws_iam_policy_document.role-trust: Reading...%0Amodule.gha-admin-tester.data.aws_iam_policy_document.role-trust: Read complete after 0s [id=3805852011]%0Aaws_iam_role_policy_attachment.ih-tf-aws-control-303467602807-read-only: Refreshing state... [id=ih-tf-aws-control-303467602807-read-only-20230811180635084000000001]%0Amodule.kibana-tester.data.aws_iam_policy_document.role-trust: Reading...%0Amodule.kibana-tester.data.aws_iam_policy_document.role-trust: Read complete after 0s [id=289138250]%0Aaws_iam_role_policy_attachment.ih-tf-cicd-control: Refreshing state... [id=ih-tf-cicd-control-20230630030803961200000001]%0Aaws_iam_access_key.twindb_test_runner: Refreshing state... [id=AKIAUNKAUEN32IWKRSEZ]%0Amodule.pypiserver-tester.data.aws_iam_policy.administrator-access: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Aaws_iam_user_policy_attachment.twindb_test_runner: Refreshing state... [id=twindb_test_runner-20230701180031084700000001]%0Amodule.gha-admin-tester.data.aws_iam_policy.administrator-access: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.website-pod-tester.aws_iam_policy.pytest-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/pytest-permissions20231123172741782300000001]%0Amodule.cloud-init-tester.data.aws_iam_policy_document.role-trust: Reading...%0Amodule.github-role-tester.aws_iam_role.role-tester: Refreshing state... [id=github-role-tester]%0Amodule.pypiserver-tester.aws_iam_role.role-tester: Refreshing state... [id=pypiserver-tester]%0Amodule.cloud-init-tester.data.aws_iam_policy_document.role-trust: Read complete after 0s [id=2092879090]%0Amodule.elasticsearch-tester.aws_iam_role.role-tester: Refreshing state... [id=elasticsearch-tester]%0Amodule.jumphost-tester.aws_iam_role.role-tester: Refreshing state... [id=jumphost-tester]%0Amodule.debian-repo-tester.aws_iam_role.role-tester: Refreshing state... [id=debian-repo-tester]%0Amodule.website-pod-tester.aws_iam_role.role-tester: Refreshing state... [id=website-pod-tester]%0Amodule.website-pod-tester.data.aws_iam_policy.administrator-access: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.ecs-tester.aws_iam_role.role-tester: Refreshing state... [id=ecs-tester]%0Amodule.gha-admin-tester.aws_iam_role.role-tester: Refreshing state... [id=gha-admin-tester]%0Adata.aws_iam_policy_document.service-network-tester-assume: Reading...%0Adata.aws_iam_policy_document.service-network-tester-assume: Read complete after 0s [id=1585108788]%0Adata.aws_iam_policy_document.state-bucket-tester-assume: Reading...%0Adata.aws_iam_policy_document.state-bucket-tester-assume: Read complete after 0s [id=1923589509]%0Amodule.kibana-tester.aws_iam_role.role-tester: Refreshing state... [id=kibana-tester]%0Amodule.infrahouse-omnibus-cache.aws_s3_bucket_ownership_controls.omnibus-cache: Refreshing state... [id=infrahouse-omnibus-cache]%0Amodule.infrahouse-omnibus-cache.aws_s3_bucket_public_access_block.omnibus-cache: Refreshing state... [id=infrahouse-omnibus-cache]%0Amodule.infrahouse-omnibus-cache.data.aws_iam_policy_document.public-access: Reading...%0Amodule.infrahouse-omnibus-cache.data.aws_iam_policy_document.public-access: Read complete after 0s [id=123587806]%0Amodule.gha-admin-tester.aws_iam_role_policy_attachment.role-permissions: Refreshing state... [id=gha-admin-tester-20231230002944742600000003]%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy.admin: Read complete after 3s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.gha-admin-tester.aws_iam_role_policy_attachment.role-pytest-permissions: Refreshing state... [id=gha-admin-tester-20231230002944603500000002]%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-assume: Reading...%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=2687752271]%0Aaws_iam_role.service-network-tester: Refreshing state... [id=service-network-tester]%0Aaws_iam_role.state-bucket-tester: Refreshing state... [id=state-bucket-tester]%0Amodule.ecs-tester.aws_iam_role_policy_attachment.role-permissions: Refreshing state... [id=ecs-tester-20231123162056194000000004]%0Amodule.ecs-tester.aws_iam_role_policy_attachment.role-pytest-permissions: Refreshing state... [id=ecs-tester-20231123162056229900000007]%0Amodule.kibana-tester.aws_iam_role_policy_attachment.role-admin-permissions[0]: Refreshing state... [id=kibana-tester-20240218030500261700000003]%0Amodule.kibana-tester.aws_iam_role_policy_attachment.role-permissions: Refreshing state... [id=kibana-tester-20240218030500270800000005]%0Amodule.kibana-tester.aws_iam_role_policy_attachment.role-pytest-permissions: Refreshing state... [id=kibana-tester-20240218030500262700000004]%0Adata.aws_iam_policy_document.omnibus-permissions: Reading...%0Adata.aws_iam_policy_document.omnibus-permissions: Read complete after 0s [id=4274068248]%0Amodule.ecs-tester.data.aws_iam_policy.administrator-access: Read complete after 4s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.ih-tf-aws-control-303467602807-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-303467602807-github]%0Aaws_iam_role_policy_attachment.ecs-tester-service-network-permissions: Refreshing state... [id=ecs-tester-20231123162056216700000006]%0Amodule.infrahouse-omnibus-cache.aws_s3_bucket_acl.omnibus-cache: Refreshing state... [id=infrahouse-omnibus-cache,public-read]%0Aaws_iam_role_policy_attachment.ecs-tester-website-pod-permissions: Refreshing state... [id=ecs-tester-20231123172742505100000003]%0Amodule.jumphost-tester.aws_iam_role_policy_attachment.role-admin-permissions[0]: Refreshing state... [id=jumphost-tester-20240226021758236100000001]%0Amodule.jumphost-tester.aws_iam_role_policy_attachment.role-permissions: Refreshing state... [id=jumphost-tester-20231230203906216900000002]%0Amodule.jumphost-tester.aws_iam_role_policy_attachment.role-pytest-permissions: Refreshing state... [id=jumphost-tester-20231230033000404500000003]%0Aaws_iam_role_policy_attachment.state-bucket-tester: Refreshing state... [id=state-bucket-tester-20231015203024244400000001]%0Aaws_iam_role_policy_attachment.state-bucket-tester-pytest-permissions: Refreshing state... [id=state-bucket-tester-20231015195201701500000001]%0Aaws_iam_role_policy_attachment.service-network-tester: Refreshing state... [id=service-network-tester-20230703194225287600000001]%0Aaws_iam_role_policy_attachment.service-network-tester-pytest-permissions: Refreshing state... [id=service-network-tester-20231009203124842800000002]%0Aaws_iam_policy.omnibus: Refreshing state... [id=arn:aws:iam::303467602807:policy/omnibus20230729042431999200000001]%0Amodule.ecs-tester.aws_iam_role_policy_attachment.role-admin-permissions[0]: Refreshing state... [id=ecs-tester-20231123162056200000000005]%0Aaws_iam_role_policy_attachment.jumphost-tester-admin-permissions: Refreshing state... [id=jumphost-tester-20231230033000404900000004]%0Amodule.website-pod-tester.aws_iam_role_policy_attachment.role-pytest-permissions: Refreshing state... [id=website-pod-tester-20231123173533875400000001]%0Amodule.website-pod-tester.aws_iam_role_policy_attachment.role-permissions: Refreshing state... [id=website-pod-tester-20231123173533923200000002]%0Amodule.website-pod-tester.aws_iam_role_policy_attachment.role-admin-permissions[0]: Refreshing state... [id=website-pod-tester-20231123173533934900000004]%0Amodule.infrahouse-omnibus-cache.aws_s3_bucket_policy.public-access: Refreshing state... [id=infrahouse-omnibus-cache]%0Aaws_iam_role_policy_attachment.website-pod-tester-sernive-network-permissions: Refreshing state... [id=website-pod-tester-20231123173533923800000003]%0Amodule.ih-tf-aws-control-303467602807-admin.aws_iam_role_policy_attachment.github: Refreshing state... [id=ih-tf-aws-control-303467602807-github-20230908004138459800000001]%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.admin-assume: Reading...%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=3570539128]%0Amodule.ih-tf-aws-control-303467602807-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-303467602807-admin]%0Aaws_iam_role_policy_attachment.omnibus: Refreshing state... [id=omnibus-20230729042432323400000002]%0Amodule.elasticsearch-tester.aws_iam_role_policy_attachment.role-pytest-permissions: Refreshing state... [id=elasticsearch-tester-20240205185312021700000007]%0Amodule.elasticsearch-tester.aws_iam_role_policy_attachment.role-permissions: Refreshing state... [id=elasticsearch-tester-20240205185311914300000005]%0Amodule.github-role-tester.aws_iam_role_policy_attachment.role-permissions: Refreshing state... [id=github-role-tester-20231108010822771800000001]%0Aaws_iam_role_policy_attachment.elasticsearch-tester-service-network-permissions: Refreshing state... [id=elasticsearch-tester-20240205185311908700000003]%0Amodule.github-role-tester.aws_iam_role_policy_attachment.role-pytest-permissions: Refreshing state... [id=github-role-tester-20231108010822830000000003]%0Amodule.elasticsearch-tester.aws_iam_role_policy_attachment.role-admin-permissions[0]: Refreshing state... [id=elasticsearch-tester-20240205185312016600000006]%0Aaws_iam_role_policy_attachment.elasticsearch-tester-website-pod-permissions: Refreshing state... [id=elasticsearch-tester-20240205185311909300000004]%0Amodule.ih-tf-aws-control-303467602807-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-303467602807-admin-20230702152748646400000001]%0Amodule.debian-repo-tester.aws_iam_role_policy_attachment.role-pytest-permissions: Refreshing state... [id=debian-repo-tester-20231109161345692400000004]%0Amodule.debian-repo-tester.aws_iam_role_policy_attachment.role-admin-permissions[0]: Refreshing state... [id=debian-repo-tester-20240222191456761200000001]%0Amodule.debian-repo-tester.aws_iam_role_policy_attachment.role-permissions: Refreshing state... [id=debian-repo-tester-20231109161345698500000005]%0Amodule.pypiserver-tester.aws_iam_role_policy_attachment.role-pytest-permissions: Refreshing state... [id=pypiserver-tester-20240220205825573000000005]%0Amodule.pypiserver-tester.aws_iam_role_policy_attachment.role-permissions: Refreshing state... [id=pypiserver-tester-20240220205825572200000004]%0Amodule.pypiserver-tester.aws_iam_role_policy_attachment.role-admin-permissions[0]: Refreshing state... [id=pypiserver-tester-20240220205825563600000003]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # aws_iam_role.omnibus will be updated in-place%0A  ~ resource "aws_iam_role" "omnibus" {%0A      ~ assume_role_policy    = jsonencode(%0A          ~ {%0A              ~ Statement = [%0A                  ~ {%0A                      ~ Principal = {%0A                          ~ AWS = [%0A                                "arn:aws:iam::990466748045:user/aleks",%0A                              - "AROAXFXZRL24D5JYG6IBW",%0A                              + "arn:aws:iam::493370826424:role/infrahouse-toolkit-github",%0A                            ]%0A                        }%0A                        # (3 unchanged attributes hidden)%0A                    },%0A                ]%0A                # (1 unchanged attribute hidden)%0A            }%0A        )%0A        id                    = "omnibus"%0A        name                  = "omnibus"%0A        tags                  = {}%0A        # (9 unchanged attributes hidden)%0A    }%0A%0A  # module.cloud-init-tester.aws_iam_policy.pytest-permissions will be created%0A  + resource "aws_iam_policy" "pytest-permissions" {%0A      + arn         = (known after apply)%0A      + id          = (known after apply)%0A      + name        = (known after apply)%0A      + name_prefix = "pytest-permissions"%0A      + path        = "/"%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = [%0A                          + "s3:PutBucketTagging",%0A                          + "s3:GetBucketTagging",%0A                          + "iam:TagRole",%0A                          + "iam:TagPolicy",%0A                          + "ec2:DescribeRegions",%0A                          + "dynamodb:TagResource",%0A                          + "dynamodb:ListTagsOfResource",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + policy_id   = (known after apply)%0A      + tags_all    = {%0A          + "created_by" = "infrahouse/aws-control-303467602807"%0A        }%0A    }%0A%0A  # module.cloud-init-tester.aws_iam_policy.role-permissions will be created%0A  + resource "aws_iam_policy" "role-permissions" {%0A      + arn         = (known after apply)%0A      + id          = (known after apply)%0A      + name        = (known after apply)%0A      + name_prefix = "cloud-init-tester-permissions"%0A      + path        = "/"%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = "sts:GetCallerIdentity"%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + policy_id   = (known after apply)%0A      + tags_all    = {%0A          + "created_by" = "infrahouse/aws-control-303467602807"%0A        }%0A    }%0A%0A  # module.cloud-init-tester.aws_iam_role.role-tester will be created%0A  + resource "aws_iam_role" "role-tester" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + AWS = "arn:aws:iam::990466748045:user/aleks"%0A                        }%0A                    },%0A                  + {%0A                      + Action    = "sts:AssumeRoleWithWebIdentity"%0A                      + Condition = {%0A                          + StringEquals = {%0A                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"%0A                            }%0A                          + StringLike   = {%0A                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-cloud-init:*"%0A                            }%0A                        }%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + description           = "Role to test module infrahouse/terraform-aws-cloud-init"%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "cloud-init-tester"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = {%0A          + "created_by" = "infrahouse/aws-control-303467602807"%0A        }%0A      + unique_id             = (known after apply)%0A    }%0A%0A  # module.cloud-init-tester.aws_iam_role_policy_attachment.role-permissions will be created%0A  + resource "aws_iam_role_policy_attachment" "role-permissions" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = "cloud-init-tester"%0A    }%0A%0A  # module.cloud-init-tester.aws_iam_role_policy_attachment.role-pytest-permissions will be created%0A  + resource "aws_iam_role_policy_attachment" "role-pytest-permissions" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = "cloud-init-tester"%0A    }%0A%0APlan: 5 to add, 1 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgInN0ZG91dCI6ICJUZXJyYWZvcm0gdXNlZCB0aGUgc2VsZWN0ZWQgcHJvdmlkZXJzIHRvIGdlbmVyYXRlIHRoZSBmb2xsb3dpbmcgZXhlY3V0aW9uXG5wbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6XG4gICsgY3JlYXRlXG4gIH4gdXBkYXRlIGluLXBsYWNlXG5cblRlcnJhZm9ybSB3aWxsIHBlcmZvcm0gdGhlIGZvbGxvd2luZyBhY3Rpb25zOlxuXG4gICMgYXdzX2lhbV9yb2xlLm9tbmlidXMgd2lsbCBiZSB1cGRhdGVkIGluLXBsYWNlXG4gIH4gcmVzb3VyY2UgXCJhd3NfaWFtX3JvbGVcIiBcIm9tbmlidXNcIiB7XG4gICAgICB+IGFzc3VtZV9yb2xlX3BvbGljeSAgICA9IGpzb25lbmNvZGUoXG4gICAgICAgICAgfiB7XG4gICAgICAgICAgICAgIH4gU3RhdGVtZW50ID0gW1xuICAgICAgICAgICAgICAgICAgfiB7XG4gICAgICAgICAgICAgICAgICAgICAgfiBQcmluY2lwYWwgPSB7XG4gICAgICAgICAgICAgICAgICAgICAgICAgIH4gQVdTID0gW1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICBcImFybjphd3M6aWFtOjo5OTA0NjY3NDgwNDU6dXNlci9hbGVrc1wiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgLSBcIkFST0FYRlhaUkwyNEQ1SllHNklCV1wiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6cm9sZS9pbmZyYWhvdXNlLXRvb2xraXQtZ2l0aHViXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgICAgICAgICAgIyAoMyB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICAgICMgKDEgdW5jaGFuZ2VkIGF0dHJpYnV0ZSBoaWRkZW4pXG4gICAgICAgICAgICB9XG4gICAgICAgIClcbiAgICAgICAgaWQgICAgICAgICAgICAgICAgICAgID0gXCJvbW5pYnVzXCJcbiAgICAgICAgbmFtZSAgICAgICAgICAgICAgICAgID0gXCJvbW5pYnVzXCJcbiAgICAgICAgdGFncyAgICAgICAgICAgICAgICAgID0ge31cbiAgICAgICAgIyAoOSB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXG4gICAgfVxuXG4gICMgbW9kdWxlLmNsb3VkLWluaXQtdGVzdGVyLmF3c19pYW1fcG9saWN5LnB5dGVzdC1wZXJtaXNzaW9ucyB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19pYW1fcG9saWN5XCIgXCJweXRlc3QtcGVybWlzc2lvbnNcIiB7XG4gICAgICArIGFybiAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpZCAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbmFtZSAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWVfcHJlZml4ID0gXCJweXRlc3QtcGVybWlzc2lvbnNcIlxuICAgICAgKyBwYXRoICAgICAgICA9IFwiL1wiXG4gICAgICArIHBvbGljeSAgICAgID0ganNvbmVuY29kZShcbiAgICAgICAgICAgIHtcbiAgICAgICAgICAgICAgKyBTdGF0ZW1lbnQgPSBbXG4gICAgICAgICAgICAgICAgICArIHtcbiAgICAgICAgICAgICAgICAgICAgICArIEFjdGlvbiAgID0gW1xuICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiczM6UHV0QnVja2V0VGFnZ2luZ1wiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiczM6R2V0QnVja2V0VGFnZ2luZ1wiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiaWFtOlRhZ1JvbGVcIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImlhbTpUYWdQb2xpY3lcIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImVjMjpEZXNjcmliZVJlZ2lvbnNcIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImR5bmFtb2RiOlRhZ1Jlc291cmNlXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJkeW5hbW9kYjpMaXN0VGFnc09mUmVzb3VyY2VcIixcbiAgICAgICAgICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgICAgICAgICArIEVmZmVjdCAgID0gXCJBbGxvd1wiXG4gICAgICAgICAgICAgICAgICAgICAgKyBSZXNvdXJjZSA9IFwiKlwiXG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICArIFZlcnNpb24gICA9IFwiMjAxMi0xMC0xN1wiXG4gICAgICAgICAgICB9XG4gICAgICAgIClcbiAgICAgICsgcG9saWN5X2lkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHRhZ3NfYWxsICAgID0ge1xuICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJcbiAgICAgICAgfVxuICAgIH1cblxuICAjIG1vZHVsZS5jbG91ZC1pbml0LXRlc3Rlci5hd3NfaWFtX3BvbGljeS5yb2xlLXBlcm1pc3Npb25zIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2lhbV9wb2xpY3lcIiBcInJvbGUtcGVybWlzc2lvbnNcIiB7XG4gICAgICArIGFybiAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpZCAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbmFtZSAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWVfcHJlZml4ID0gXCJjbG91ZC1pbml0LXRlc3Rlci1wZXJtaXNzaW9uc1wiXG4gICAgICArIHBhdGggICAgICAgID0gXCIvXCJcbiAgICAgICsgcG9saWN5ICAgICAgPSBqc29uZW5jb2RlKFxuICAgICAgICAgICAge1xuICAgICAgICAgICAgICArIFN0YXRlbWVudCA9IFtcbiAgICAgICAgICAgICAgICAgICsge1xuICAgICAgICAgICAgICAgICAgICAgICsgQWN0aW9uICAgPSBcInN0czpHZXRDYWxsZXJJZGVudGl0eVwiXG4gICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICA9IFwiQWxsb3dcIlxuICAgICAgICAgICAgICAgICAgICAgICsgUmVzb3VyY2UgPSBcIipcIlxuICAgICAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgKyBWZXJzaW9uICAgPSBcIjIwMTItMTAtMTdcIlxuICAgICAgICAgICAgfVxuICAgICAgICApXG4gICAgICArIHBvbGljeV9pZCAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB0YWdzX2FsbCAgICA9IHtcbiAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXG4gICAgICAgIH1cbiAgICB9XG5cbiAgIyBtb2R1bGUuY2xvdWQtaW5pdC10ZXN0ZXIuYXdzX2lhbV9yb2xlLnJvbGUtdGVzdGVyIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlXCIgXCJyb2xlLXRlc3RlclwiIHtcbiAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBhc3N1bWVfcm9sZV9wb2xpY3kgICAgPSBqc29uZW5jb2RlKFxuICAgICAgICAgICAge1xuICAgICAgICAgICAgICArIFN0YXRlbWVudCA9IFtcbiAgICAgICAgICAgICAgICAgICsge1xuICAgICAgICAgICAgICAgICAgICAgICsgQWN0aW9uICAgID0gXCJzdHM6QXNzdW1lUm9sZVwiXG4gICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICAgPSBcIkFsbG93XCJcbiAgICAgICAgICAgICAgICAgICAgICArIFByaW5jaXBhbCA9IHtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBBV1MgPSBcImFybjphd3M6aWFtOjo5OTA0NjY3NDgwNDU6dXNlci9hbGVrc1wiXG4gICAgICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgICArIHtcbiAgICAgICAgICAgICAgICAgICAgICArIEFjdGlvbiAgICA9IFwic3RzOkFzc3VtZVJvbGVXaXRoV2ViSWRlbnRpdHlcIlxuICAgICAgICAgICAgICAgICAgICAgICsgQ29uZGl0aW9uID0ge1xuICAgICAgICAgICAgICAgICAgICAgICAgICArIFN0cmluZ0VxdWFscyA9IHtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJ0b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbTphdWRcIiA9IFwic3RzLmFtYXpvbmF3cy5jb21cIlxuICAgICAgICAgICAgICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBTdHJpbmdMaWtlICAgPSB7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgICArIFwidG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb206c3ViXCIgPSBcInJlcG86aW5mcmFob3VzZS90ZXJyYWZvcm0tYXdzLWNsb3VkLWluaXQ6KlwiXG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgID0gXCJBbGxvd1wiXG4gICAgICAgICAgICAgICAgICAgICAgKyBQcmluY2lwYWwgPSB7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgRmVkZXJhdGVkID0gXCJhcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3Om9pZGMtcHJvdmlkZXIvdG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb21cIlxuICAgICAgICAgICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgKyBWZXJzaW9uICAgPSBcIjIwMTItMTAtMTdcIlxuICAgICAgICAgICAgfVxuICAgICAgICApXG4gICAgICArIGNyZWF0ZV9kYXRlICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgZGVzY3JpcHRpb24gICAgICAgICAgID0gXCJSb2xlIHRvIHRlc3QgbW9kdWxlIGluZnJhaG91c2UvdGVycmFmb3JtLWF3cy1jbG91ZC1pbml0XCJcbiAgICAgICsgZm9yY2VfZGV0YWNoX3BvbGljaWVzID0gZmFsc2VcbiAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBtYW5hZ2VkX3BvbGljeV9hcm5zICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG1heF9zZXNzaW9uX2R1cmF0aW9uICA9IDM2MDBcbiAgICAgICsgbmFtZSAgICAgICAgICAgICAgICAgID0gXCJjbG91ZC1pbml0LXRlc3RlclwiXG4gICAgICArIG5hbWVfcHJlZml4ICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcGF0aCAgICAgICAgICAgICAgICAgID0gXCIvXCJcbiAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJcbiAgICAgICAgfVxuICAgICAgKyB1bmlxdWVfaWQgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgfVxuXG4gICMgbW9kdWxlLmNsb3VkLWluaXQtdGVzdGVyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5yb2xlLXBlcm1pc3Npb25zIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50XCIgXCJyb2xlLXBlcm1pc3Npb25zXCIge1xuICAgICAgKyBpZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwb2xpY3lfYXJuID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyByb2xlICAgICAgID0gXCJjbG91ZC1pbml0LXRlc3RlclwiXG4gICAgfVxuXG4gICMgbW9kdWxlLmNsb3VkLWluaXQtdGVzdGVyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5yb2xlLXB5dGVzdC1wZXJtaXNzaW9ucyB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudFwiIFwicm9sZS1weXRlc3QtcGVybWlzc2lvbnNcIiB7XG4gICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBvbGljeV9hcm4gPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHJvbGUgICAgICAgPSBcImNsb3VkLWluaXQtdGVzdGVyXCJcbiAgICB9XG5cblBsYW46IDUgdG8gYWRkLCAxIHRvIGNoYW5nZSwgMCB0byBkZXN0cm95LlxuXG5cdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcblxuU2F2ZWQgdGhlIHBsYW4gdG86IHRmLnBsYW5cblxuVG8gcGVyZm9ybSBleGFjdGx5IHRoZXNlIGFjdGlvbnMsIHJ1biB0aGUgZm9sbG93aW5nIGNvbW1hbmQgdG8gYXBwbHk6XG4gICAgdGVycmFmb3JtIGFwcGx5IFwidGYucGxhblwiXG46OmRlYnVnOjpUZXJyYWZvcm0gZXhpdGVkIHdpdGggY29kZSAwLlxuOjpkZWJ1Zzo6c3Rkb3V0OiBkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1yZWFkLW9ubHktYXNzdW1lOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5vbW5pYnVzLWFzc3VtZTogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuc3RhdGUtYnVja2V0LXRlc3Rlci1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtaWgtY2ljZC1jb250cm9sLWFzc3VtZTogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXJlYWQtb25seS1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTI4OTk2Mjk5NTJdJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5vbW5pYnVzLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjEwMTUwOTA3Ml0lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnNlcnZpY2UtbmV0d29yay10ZXN0ZXItcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnN0YXRlLWJ1Y2tldC10ZXN0ZXItcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQwMjg1MDY1NzZdJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5paC10Zi1paC1jaWNkLWNvbnRyb2wtYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xMTU0OTg5OTM2XSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuc2VydmljZS1uZXR3b3JrLXRlc3Rlci1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzgzNzAwNTE0MF0lMEFhd3NfZWMyX3NlcmlhbF9jb25zb2xlX2FjY2Vzcy5jb25zb2xlLXVlMjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dXMtZWFzdC0xXSUwQWF3c19lYzJfc2VyaWFsX2NvbnNvbGVfYWNjZXNzLmNvbnNvbGUtdWUxOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD11cy1lYXN0LTFdJTBBbW9kdWxlLmRlYmlhbi1yZXBvLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnB5dGVzdC1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQW1vZHVsZS5weXBpc2VydmVyLXRlc3Rlci5kYXRhLmF3c19pYW1fb3BlbmlkX2Nvbm5lY3RfcHJvdmlkZXIuZ2l0aHViOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmdpdGh1Yi1yb2xlLXRlc3Rlci5kYXRhLmF3c19pYW1fb3BlbmlkX2Nvbm5lY3RfcHJvdmlkZXIuZ2l0aHViOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmtpYmFuYS10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5weXRlc3QtcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5LnJlYWQtb25seS1hY2Nlc3M6IFJlYWRpbmcuLi4lMEFtb2R1bGUuZWxhc3RpY3NlYXJjaC10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZGluZy4uLiUwQW1vZHVsZS5raWJhbmEtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmdpdGh1Yi1yb2xlLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkaW5nLi4uJTBBYXdzX2lhbV9wb2xpY3kuVHdpbkRCVGVzdFJ1bm5lcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvVHdpbkRCVGVzdFJ1bm5lcl0lMEFtb2R1bGUuZGViaWFuLXJlcG8tdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucHl0ZXN0LXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00Mzg1MzM3MTBdJTBBbW9kdWxlLmtpYmFuYS10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5weXRlc3QtcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQzODUzMzcxMF0lMEFhd3Nfc3NtX3BhcmFtZXRlci5naF9zZWNyZXRzX25hbWVzcGFjZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2hfc2VjcmV0c19uYW1lc3BhY2VdJTBBbW9kdWxlLmdoYS1hZG1pbi10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5weXRlc3QtcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFtb2R1bGUuZ2hhLWFkbWluLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnB5dGVzdC1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDM4NTMzNzEwXSUwQWF3c19pYW1fcG9saWN5LnNlcnZpY2UtbmV0d29yay10ZXN0ZXItcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L3NlcnZpY2UtbmV0d29yay10ZXN0ZXItcGVybWlzc2lvbnNdJTBBbW9kdWxlLmdpdGh1Yi1yb2xlLXRlc3Rlci5kYXRhLmF3c19pYW1fb3BlbmlkX2Nvbm5lY3RfcHJvdmlkZXIuZ2l0aHViOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3Om9pZGMtcHJvdmlkZXIvdG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb21dJTBBbW9kdWxlLmVsYXN0aWNzZWFyY2gtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucm9sZS1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQW1vZHVsZS5weXBpc2VydmVyLXRlc3Rlci5kYXRhLmF3c19pYW1fb3BlbmlkX2Nvbm5lY3RfcHJvdmlkZXIuZ2l0aHViOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3Om9pZGMtcHJvdmlkZXIvdG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb21dJTBBYXdzX2VjMl9zZXJpYWxfY29uc29sZV9hY2Nlc3MuY29uc29sZS11dzE6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXVzLXdlc3QtMV0lMEFtb2R1bGUuZWxhc3RpY3NlYXJjaC10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5yb2xlLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xMzY3MzQ1NDAxXSUwQW1vZHVsZS5naXRodWItcm9sZS10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5yb2xlLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmdpdGh1Yi1yb2xlLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJvbGUtcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTM0MTg3NTEwNjldJTBBbW9kdWxlLmNsb3VkLWluaXQtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucm9sZS1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQW1vZHVsZS5jbG91ZC1pbml0LXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJvbGUtcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTEzNjczNDU0MDFdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTMxMzM4NDE3NzVdJTBBbW9kdWxlLnB5cGlzZXJ2ZXItdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucHl0ZXN0LXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBbW9kdWxlLnB5cGlzZXJ2ZXItdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucHl0ZXN0LXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00Mzg1MzM3MTBdJTBBYXdzX2lhbV9yb2xlLm9tbmlidXM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPW9tbmlidXNdJTBBbW9kdWxlLmVsYXN0aWNzZWFyY2gtdGVzdGVyLmRhdGEuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnB5dGVzdC1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucHl0ZXN0LXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00Mzg1MzM3MTBdJTBBbW9kdWxlLmp1bXBob3N0LXRlc3Rlci5kYXRhLmF3c19pYW1fb3BlbmlkX2Nvbm5lY3RfcHJvdmlkZXIuZ2l0aHViOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmVsYXN0aWNzZWFyY2gtdGVzdGVyLmRhdGEuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbV0lMEFtb2R1bGUua2liYW5hLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJvbGUtcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFtb2R1bGUua2liYW5hLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJvbGUtcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTEzNjczNDU0MDFdJTBBbW9kdWxlLmRlYmlhbi1yZXBvLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJvbGUtcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFtb2R1bGUuZGViaWFuLXJlcG8tdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucm9sZS1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjQyMDA3NTMwMl0lMEFtb2R1bGUuanVtcGhvc3QtdGVzdGVyLmRhdGEuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbV0lMEFtb2R1bGUuZWNzLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnB5dGVzdC1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQW1vZHVsZS5lY3MtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucHl0ZXN0LXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00Mzg1MzM3MTBdJTBBbW9kdWxlLmp1bXBob3N0LXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkaW5nLi4uJTBBbW9kdWxlLndlYnNpdGUtcG9kLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJvbGUtcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFtb2R1bGUud2Vic2l0ZS1wb2QtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucm9sZS1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTUzODIyMjIyNV0lMEFtb2R1bGUuZ2hhLWFkbWluLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJvbGUtcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFtb2R1bGUuZ2hhLWFkbWluLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJvbGUtcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTMyNDc5Mzg0ODVdJTBBbW9kdWxlLmVsYXN0aWNzZWFyY2gtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucHl0ZXN0LXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmVsYXN0aWNzZWFyY2gtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucHl0ZXN0LXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00Mzg1MzM3MTBdJTBBbW9kdWxlLmluZnJhaG91c2Utb21uaWJ1cy1jYWNoZS5hd3NfczNfYnVja2V0Lm9tbmlidXMtY2FjaGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utb21uaWJ1cy1jYWNoZV0lMEFtb2R1bGUuZGViaWFuLXJlcG8tdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWRpbmcuLi4lMEFtb2R1bGUuZGViaWFuLXJlcG8tdGVzdGVyLmRhdGEuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlYWRpbmcuLi4lMEFtb2R1bGUuZGViaWFuLXJlcG8tdGVzdGVyLmRhdGEuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbV0lMEFtb2R1bGUucHlwaXNlcnZlci10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5yb2xlLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBbW9kdWxlLnB5cGlzZXJ2ZXItdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucm9sZS1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTM2NzM0NTQwMV0lMEFtb2R1bGUud2Vic2l0ZS1wb2QtdGVzdGVyLmRhdGEuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlYWRpbmcuLi4lMEFtb2R1bGUud2Vic2l0ZS1wb2QtdGVzdGVyLmRhdGEuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbV0lMEFtb2R1bGUuanVtcGhvc3QtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucm9sZS1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQW1vZHVsZS5qdW1waG9zdC10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5yb2xlLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xOTk1MjA0MDA5XSUwQW1vZHVsZS5pbmZyYWhvdXNlX2NvbS5hd3Nfcm91dGU1M196b25lLmNpX2NkX2luZnJhaG91c2VfY29tOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDY3OTAwODJPVTBQT1BXT0NQWjRdJTBBYXdzX2lhbV9yb2xlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1yZWFkLW9ubHk6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1yZWFkLW9ubHldJTBBbW9kdWxlLmp1bXBob3N0LXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnB5dGVzdC1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQW1vZHVsZS5qdW1waG9zdC10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5weXRlc3QtcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQzODUzMzcxMF0lMEFtb2R1bGUuZWNzLXRlc3Rlci5kYXRhLmF3c19pYW1fb3BlbmlkX2Nvbm5lY3RfcHJvdmlkZXIuZ2l0aHViOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc10lMEFtb2R1bGUuZ2hhLWFkbWluLXRlc3Rlci5kYXRhLmF3c19pYW1fb3BlbmlkX2Nvbm5lY3RfcHJvdmlkZXIuZ2l0aHViOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmVsYXN0aWNzZWFyY2gtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NdJTBBbW9kdWxlLmNsb3VkLWluaXQtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWRpbmcuLi4lMEFtb2R1bGUuZ2hhLWFkbWluLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmtpYmFuYS10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc10lMEFtb2R1bGUuZWNzLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJvbGUtcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFtb2R1bGUuZWNzLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJvbGUtcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTEzNjczNDU0MDFdJTBBbW9kdWxlLnB5cGlzZXJ2ZXItdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWRpbmcuLi4lMEFtb2R1bGUuZ2l0aHViLXJvbGUtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NdJTBBbW9kdWxlLmdpdGh1Yi1yb2xlLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnB5dGVzdC1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQW1vZHVsZS5lY3MtdGVzdGVyLmRhdGEuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbV0lMEFtb2R1bGUuZ2l0aHViLXJvbGUtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucHl0ZXN0LXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00Mzg1MzM3MTBdJTBBYXdzX2lhbV9yb2xlLmloLXRmLWNpY2QtY29udHJvbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtY2ljZC1jb250cm9sXSUwQWF3c19pYW1fcG9saWN5LnN0YXRlLWJ1Y2tldC10ZXN0ZXItcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L3N0YXRlLWJ1Y2tldC10ZXN0ZXItcGVybWlzc2lvbnNdJTBBbW9kdWxlLmdoYS1hZG1pbi10ZXN0ZXIuZGF0YS5hd3NfaWFtX29wZW5pZF9jb25uZWN0X3Byb3ZpZGVyLmdpdGh1YjogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpvaWRjLXByb3ZpZGVyL3Rva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tXSUwQW1vZHVsZS5naXRodWItY29ubmVjdG9yLmF3c19pYW1fb3BlbmlkX2Nvbm5lY3RfcHJvdmlkZXIuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3Om9pZGMtcHJvdmlkZXIvdG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb21dJTBBZGF0YS5hd3NfaWFtX3BvbGljeS5yZWFkLW9ubHktYWNjZXNzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9SZWFkT25seUFjY2Vzc10lMEFtb2R1bGUua2liYW5hLXRlc3Rlci5kYXRhLmF3c19pYW1fb3BlbmlkX2Nvbm5lY3RfcHJvdmlkZXIuZ2l0aHViOiBSZWFkaW5nLi4uJTBBbW9kdWxlLndlYnNpdGUtcG9kLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmNsb3VkLWluaXQtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucHl0ZXN0LXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmNsb3VkLWluaXQtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucHl0ZXN0LXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00Mzg1MzM3MTBdJTBBbW9kdWxlLmVjcy10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZGluZy4uLiUwQW1vZHVsZS5raWJhbmEtdGVzdGVyLmRhdGEuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbV0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW46IFJlYWRpbmcuLi4lMEFhd3NfaWFtX3VzZXIudHdpbmRiX3Rlc3RfcnVubmVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10d2luZGJfdGVzdF9ydW5uZXJdJTBBbW9kdWxlLmp1bXBob3N0LXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXSUwQW1vZHVsZS5jbG91ZC1pbml0LXRlc3Rlci5kYXRhLmF3c19pYW1fb3BlbmlkX2Nvbm5lY3RfcHJvdmlkZXIuZ2l0aHViOiBSZWFkaW5nLi4uJTBBbW9kdWxlLndlYnNpdGUtcG9kLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnB5dGVzdC1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQW1vZHVsZS53ZWJzaXRlLXBvZC10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5weXRlc3QtcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQzODUzMzcxMF0lMEFtb2R1bGUuZGViaWFuLXJlcG8tdGVzdGVyLmF3c19pYW1fcG9saWN5LnB5dGVzdC1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvcHl0ZXN0LXBlcm1pc3Npb25zMjAyMzExMDkxNjEzNDQ4OTQ0MDAwMDAwMDJdJTBBbW9kdWxlLmRlYmlhbi1yZXBvLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXSUwQW1vZHVsZS5raWJhbmEtdGVzdGVyLmF3c19pYW1fcG9saWN5LnB5dGVzdC1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvcHl0ZXN0LXBlcm1pc3Npb25zMjAyNDAyMTgwMzA0NTkyOTU4MDAwMDAwMDFdJTBBbW9kdWxlLmNsb3VkLWluaXQtdGVzdGVyLmRhdGEuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbV0lMEFtb2R1bGUuZ2hhLWFkbWluLXRlc3Rlci5hd3NfaWFtX3BvbGljeS5weXRlc3QtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L3B5dGVzdC1wZXJtaXNzaW9uczIwMjMxMjMwMDAyNzA0NDk2MDAwMDAwMDAyXSUwQW1vZHVsZS5naXRodWItcm9sZS10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5yb2xlLXRydXN0OiBSZWFkaW5nLi4uJTBBbW9kdWxlLmdpdGh1Yi1yb2xlLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJvbGUtdHJ1c3Q6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE1OTY5OTA3ODFdJTBBbW9kdWxlLnB5cGlzZXJ2ZXItdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucm9sZS10cnVzdDogUmVhZGluZy4uLiUwQW1vZHVsZS5weXBpc2VydmVyLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJvbGUtdHJ1c3Q6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTIwMzA2NjAyMTVdJTBBbW9kdWxlLmVsYXN0aWNzZWFyY2gtdGVzdGVyLmF3c19pYW1fcG9saWN5LnJvbGUtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L2VsYXN0aWNzZWFyY2gtdGVzdGVyLXBlcm1pc3Npb25zMjAyNDAyMDUxODUzMTExNjYxMDAwMDAwMDJdJTBBbW9kdWxlLmdpdGh1Yi1yb2xlLXRlc3Rlci5hd3NfaWFtX3BvbGljeS5yb2xlLXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnBvbGljeS9naXRodWItcm9sZS10ZXN0ZXItcGVybWlzc2lvbnMyMDIzMTEwODAwNTk0NDEyMzIwMDAwMDAwMV0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmF3c19pYW1fcG9saWN5LmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWdpdGh1Yl0lMEFtb2R1bGUucHlwaXNlcnZlci10ZXN0ZXIuYXdzX2lhbV9wb2xpY3kucHl0ZXN0LXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnBvbGljeS9weXRlc3QtcGVybWlzc2lvbnMyMDI0MDIyMDIwNTgyNTI3NTQwMDAwMDAwMl0lMEFhd3NfaWFtX3BvbGljeS5weXRlc3QtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L3B5dGVzdC1wZXJtaXNzaW9uczIwMjMxMDA5MjAzMTI0NTU1NTAwMDAwMDAxXSUwQW1vZHVsZS5lbGFzdGljc2VhcmNoLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJvbGUtdHJ1c3Q6IFJlYWRpbmcuLi4lMEFtb2R1bGUuZWxhc3RpY3NlYXJjaC10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5yb2xlLXRydXN0OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xNDAzMzMzNTM0XSUwQW1vZHVsZS5raWJhbmEtdGVzdGVyLmF3c19pYW1fcG9saWN5LnJvbGUtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L2tpYmFuYS10ZXN0ZXItcGVybWlzc2lvbnMyMDI0MDIxODAzMDQ1OTI5NjAwMDAwMDAwMl0lMEFtb2R1bGUuanVtcGhvc3QtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucm9sZS10cnVzdDogUmVhZGluZy4uLiUwQW1vZHVsZS5qdW1waG9zdC10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5yb2xlLXRydXN0OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zMzc5MDU5NTAwXSUwQW1vZHVsZS5kZWJpYW4tcmVwby10ZXN0ZXIuYXdzX2lhbV9wb2xpY3kucm9sZS1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvZGViaWFuLXJlcG8tdGVzdGVyLXBlcm1pc3Npb25zMjAyMzExMDkxNjEzNDQ4OTQ0MDAwMDAwMDFdJTBBbW9kdWxlLmVjcy10ZXN0ZXIuYXdzX2lhbV9wb2xpY3kucHl0ZXN0LXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnBvbGljeS9weXRlc3QtcGVybWlzc2lvbnMyMDIzMTEyMzE2MjA1NTg5MTkwMDAwMDAwMl0lMEFtb2R1bGUud2Vic2l0ZS1wb2QtdGVzdGVyLmF3c19pYW1fcG9saWN5LnJvbGUtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L3dlYnNpdGUtcG9kLXRlc3Rlci1wZXJtaXNzaW9uczIwMjMxMTIzMTcyNzQxOTYxODAwMDAwMDAyXSUwQW1vZHVsZS5naGEtYWRtaW4tdGVzdGVyLmF3c19pYW1fcG9saWN5LnJvbGUtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L2doYS1hZG1pbi10ZXN0ZXItcGVybWlzc2lvbnMyMDIzMTIzMDAwMjcwNDQ5NTAwMDAwMDAwMV0lMEFtb2R1bGUuZWxhc3RpY3NlYXJjaC10ZXN0ZXIuYXdzX2lhbV9wb2xpY3kucHl0ZXN0LXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnBvbGljeS9weXRlc3QtcGVybWlzc2lvbnMyMDI0MDIwNTE4NTMxMTE2NjEwMDAwMDAwMV0lMEFtb2R1bGUuZGViaWFuLXJlcG8tdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucm9sZS10cnVzdDogUmVhZGluZy4uLiUwQW1vZHVsZS5kZWJpYW4tcmVwby10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5yb2xlLXRydXN0OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zNzM2NDkyMTU5XSUwQW1vZHVsZS5weXBpc2VydmVyLXRlc3Rlci5hd3NfaWFtX3BvbGljeS5yb2xlLXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnBvbGljeS9weXBpc2VydmVyLXRlc3Rlci1wZXJtaXNzaW9uczIwMjQwMjIwMjA1ODI1Mjc1MzAwMDAwMDAxXSUwQW1vZHVsZS53ZWJzaXRlLXBvZC10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5yb2xlLXRydXN0OiBSZWFkaW5nLi4uJTBBbW9kdWxlLndlYnNpdGUtcG9kLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJvbGUtdHJ1c3Q6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTEzOTkyNDEzMDFdJTBBbW9kdWxlLmp1bXBob3N0LXRlc3Rlci5hd3NfaWFtX3BvbGljeS5yb2xlLXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnBvbGljeS9qdW1waG9zdC10ZXN0ZXItcGVybWlzc2lvbnMyMDIzMTIzMDIwMzkwNTk2MjIwMDAwMDAwMV0lMEFtb2R1bGUuanVtcGhvc3QtdGVzdGVyLmF3c19pYW1fcG9saWN5LnB5dGVzdC1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvcHl0ZXN0LXBlcm1pc3Npb25zMjAyMzEyMzAwMzMwMDAxNTY0MDAwMDAwMDJdJTBBbW9kdWxlLmVjcy10ZXN0ZXIuYXdzX2lhbV9wb2xpY3kucm9sZS1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvZWNzLXRlc3Rlci1wZXJtaXNzaW9uczIwMjMxMTIzMTYyMDU1ODkxNDAwMDAwMDAxXSUwQW1vZHVsZS5lY3MtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucm9sZS10cnVzdDogUmVhZGluZy4uLiUwQW1vZHVsZS5lY3MtdGVzdGVyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucm9sZS10cnVzdDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9ODY5MDE3MDYyXSUwQW1vZHVsZS5naXRodWItcm9sZS10ZXN0ZXIuYXdzX2lhbV9wb2xpY3kucHl0ZXN0LXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnBvbGljeS9weXRlc3QtcGVybWlzc2lvbnMyMDIzMTEwODAwMzk0NjAyODcwMDAwMDAwMl0lMEFtb2R1bGUuY2xvdWQtaW5pdC10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc10lMEFtb2R1bGUuZ2hhLWFkbWluLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJvbGUtdHJ1c3Q6IFJlYWRpbmcuLi4lMEFtb2R1bGUuZ2hhLWFkbWluLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJvbGUtdHJ1c3Q6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTM4MDU4NTIwMTFdJTBBYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1yZWFkLW9ubHk6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1yZWFkLW9ubHktMjAyMzA4MTExODA2MzUwODQwMDAwMDAwMDFdJTBBbW9kdWxlLmtpYmFuYS10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5yb2xlLXRydXN0OiBSZWFkaW5nLi4uJTBBbW9kdWxlLmtpYmFuYS10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5yb2xlLXRydXN0OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yODkxMzgyNTBdJTBBYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmloLXRmLWNpY2QtY29udHJvbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtY2ljZC1jb250cm9sLTIwMjMwNjMwMDMwODAzOTYxMjAwMDAwMDAxXSUwQWF3c19pYW1fYWNjZXNzX2tleS50d2luZGJfdGVzdF9ydW5uZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPUFLSUFVTktBVUVOMzJJV0tSU0VaXSUwQW1vZHVsZS5weXBpc2VydmVyLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXSUwQWF3c19pYW1fdXNlcl9wb2xpY3lfYXR0YWNobWVudC50d2luZGJfdGVzdF9ydW5uZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXR3aW5kYl90ZXN0X3J1bm5lci0yMDIzMDcwMTE4MDAzMTA4NDcwMDAwMDAwMV0lMEFtb2R1bGUuZ2hhLWFkbWluLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXSUwQW1vZHVsZS53ZWJzaXRlLXBvZC10ZXN0ZXIuYXdzX2lhbV9wb2xpY3kucHl0ZXN0LXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnBvbGljeS9weXRlc3QtcGVybWlzc2lvbnMyMDIzMTEyMzE3Mjc0MTc4MjMwMDAwMDAwMV0lMEFtb2R1bGUuY2xvdWQtaW5pdC10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5yb2xlLXRydXN0OiBSZWFkaW5nLi4uJTBBbW9kdWxlLmdpdGh1Yi1yb2xlLXRlc3Rlci5hd3NfaWFtX3JvbGUucm9sZS10ZXN0ZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdpdGh1Yi1yb2xlLXRlc3Rlcl0lMEFtb2R1bGUucHlwaXNlcnZlci10ZXN0ZXIuYXdzX2lhbV9yb2xlLnJvbGUtdGVzdGVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1weXBpc2VydmVyLXRlc3Rlcl0lMEFtb2R1bGUuY2xvdWQtaW5pdC10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5yb2xlLXRydXN0OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yMDkyODc5MDkwXSUwQW1vZHVsZS5lbGFzdGljc2VhcmNoLXRlc3Rlci5hd3NfaWFtX3JvbGUucm9sZS10ZXN0ZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWVsYXN0aWNzZWFyY2gtdGVzdGVyXSUwQW1vZHVsZS5qdW1waG9zdC10ZXN0ZXIuYXdzX2lhbV9yb2xlLnJvbGUtdGVzdGVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1qdW1waG9zdC10ZXN0ZXJdJTBBbW9kdWxlLmRlYmlhbi1yZXBvLXRlc3Rlci5hd3NfaWFtX3JvbGUucm9sZS10ZXN0ZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWRlYmlhbi1yZXBvLXRlc3Rlcl0lMEFtb2R1bGUud2Vic2l0ZS1wb2QtdGVzdGVyLmF3c19pYW1fcm9sZS5yb2xlLXRlc3RlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9d2Vic2l0ZS1wb2QtdGVzdGVyXSUwQW1vZHVsZS53ZWJzaXRlLXBvZC10ZXN0ZXIuZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc10lMEFtb2R1bGUuZWNzLXRlc3Rlci5hd3NfaWFtX3JvbGUucm9sZS10ZXN0ZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWVjcy10ZXN0ZXJdJTBBbW9kdWxlLmdoYS1hZG1pbi10ZXN0ZXIuYXdzX2lhbV9yb2xlLnJvbGUtdGVzdGVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naGEtYWRtaW4tdGVzdGVyXSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuc2VydmljZS1uZXR3b3JrLXRlc3Rlci1hc3N1bWU6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnNlcnZpY2UtbmV0d29yay10ZXN0ZXItYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xNTg1MTA4Nzg4XSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuc3RhdGUtYnVja2V0LXRlc3Rlci1hc3N1bWU6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnN0YXRlLWJ1Y2tldC10ZXN0ZXItYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xOTIzNTg5NTA5XSUwQW1vZHVsZS5raWJhbmEtdGVzdGVyLmF3c19pYW1fcm9sZS5yb2xlLXRlc3RlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9a2liYW5hLXRlc3Rlcl0lMEFtb2R1bGUuaW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlLmF3c19zM19idWNrZXRfb3duZXJzaGlwX2NvbnRyb2xzLm9tbmlidXMtY2FjaGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utb21uaWJ1cy1jYWNoZV0lMEFtb2R1bGUuaW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlLmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5vbW5pYnVzLWNhY2hlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGVdJTBBbW9kdWxlLmluZnJhaG91c2Utb21uaWJ1cy1jYWNoZS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnB1YmxpYy1hY2Nlc3M6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucHVibGljLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTIzNTg3ODA2XSUwQW1vZHVsZS5naGEtYWRtaW4tdGVzdGVyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5yb2xlLXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naGEtYWRtaW4tdGVzdGVyLTIwMjMxMjMwMDAyOTQ0NzQyNjAwMDAwMDAzXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbjogUmVhZCBjb21wbGV0ZSBhZnRlciAzcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc10lMEFtb2R1bGUuZ2hhLWFkbWluLXRlc3Rlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQucm9sZS1weXRlc3QtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdoYS1hZG1pbi10ZXN0ZXItMjAyMzEyMzAwMDI5NDQ2MDM1MDAwMDAwMDJdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1hc3N1bWU6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjY4Nzc1MjI3MV0lMEFhd3NfaWFtX3JvbGUuc2VydmljZS1uZXR3b3JrLXRlc3RlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2VydmljZS1uZXR3b3JrLXRlc3Rlcl0lMEFhd3NfaWFtX3JvbGUuc3RhdGUtYnVja2V0LXRlc3RlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c3RhdGUtYnVja2V0LXRlc3Rlcl0lMEFtb2R1bGUuZWNzLXRlc3Rlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQucm9sZS1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ZWNzLXRlc3Rlci0yMDIzMTEyMzE2MjA1NjE5NDAwMDAwMDAwNF0lMEFtb2R1bGUuZWNzLXRlc3Rlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQucm9sZS1weXRlc3QtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWVjcy10ZXN0ZXItMjAyMzExMjMxNjIwNTYyMjk5MDAwMDAwMDddJTBBbW9kdWxlLmtpYmFuYS10ZXN0ZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnJvbGUtYWRtaW4tcGVybWlzc2lvbnNbMF06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWtpYmFuYS10ZXN0ZXItMjAyNDAyMTgwMzA1MDAyNjE3MDAwMDAwMDNdJTBBbW9kdWxlLmtpYmFuYS10ZXN0ZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnJvbGUtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWtpYmFuYS10ZXN0ZXItMjAyNDAyMTgwMzA1MDAyNzA4MDAwMDAwMDVdJTBBbW9kdWxlLmtpYmFuYS10ZXN0ZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnJvbGUtcHl0ZXN0LXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1raWJhbmEtdGVzdGVyLTIwMjQwMjE4MDMwNTAwMjYyNzAwMDAwMDA0XSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQub21uaWJ1cy1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQub21uaWJ1cy1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDI3NDA2ODI0OF0lMEFtb2R1bGUuZWNzLXRlc3Rlci5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDRzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uYXdzX2lhbV9yb2xlLmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWdpdGh1Yl0lMEFhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuZWNzLXRlc3Rlci1zZXJ2aWNlLW5ldHdvcmstcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWVjcy10ZXN0ZXItMjAyMzExMjMxNjIwNTYyMTY3MDAwMDAwMDZdJTBBbW9kdWxlLmluZnJhaG91c2Utb21uaWJ1cy1jYWNoZS5hd3NfczNfYnVja2V0X2FjbC5vbW5pYnVzLWNhY2hlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGUscHVibGljLXJlYWRdJTBBYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmVjcy10ZXN0ZXItd2Vic2l0ZS1wb2QtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWVjcy10ZXN0ZXItMjAyMzExMjMxNzI3NDI1MDUxMDAwMDAwMDNdJTBBbW9kdWxlLmp1bXBob3N0LXRlc3Rlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQucm9sZS1hZG1pbi1wZXJtaXNzaW9uc1swXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9anVtcGhvc3QtdGVzdGVyLTIwMjQwMjI2MDIxNzU4MjM2MTAwMDAwMDAxXSUwQW1vZHVsZS5qdW1waG9zdC10ZXN0ZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnJvbGUtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWp1bXBob3N0LXRlc3Rlci0yMDIzMTIzMDIwMzkwNjIxNjkwMDAwMDAwMl0lMEFtb2R1bGUuanVtcGhvc3QtdGVzdGVyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5yb2xlLXB5dGVzdC1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9anVtcGhvc3QtdGVzdGVyLTIwMjMxMjMwMDMzMDAwNDA0NTAwMDAwMDAzXSUwQWF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1idWNrZXQtdGVzdGVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zdGF0ZS1idWNrZXQtdGVzdGVyLTIwMjMxMDE1MjAzMDI0MjQ0NDAwMDAwMDAxXSUwQWF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1idWNrZXQtdGVzdGVyLXB5dGVzdC1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c3RhdGUtYnVja2V0LXRlc3Rlci0yMDIzMTAxNTE5NTIwMTcwMTUwMDAwMDAwMV0lMEFhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc2VydmljZS1uZXR3b3JrLXRlc3RlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2VydmljZS1uZXR3b3JrLXRlc3Rlci0yMDIzMDcwMzE5NDIyNTI4NzYwMDAwMDAwMV0lMEFhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc2VydmljZS1uZXR3b3JrLXRlc3Rlci1weXRlc3QtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNlcnZpY2UtbmV0d29yay10ZXN0ZXItMjAyMzEwMDkyMDMxMjQ4NDI4MDAwMDAwMDJdJTBBYXdzX2lhbV9wb2xpY3kub21uaWJ1czogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvb21uaWJ1czIwMjMwNzI5MDQyNDMxOTk5MjAwMDAwMDAxXSUwQW1vZHVsZS5lY3MtdGVzdGVyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5yb2xlLWFkbWluLXBlcm1pc3Npb25zWzBdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1lY3MtdGVzdGVyLTIwMjMxMTIzMTYyMDU2MjAwMDAwMDAwMDA1XSUwQWF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5qdW1waG9zdC10ZXN0ZXItYWRtaW4tcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWp1bXBob3N0LXRlc3Rlci0yMDIzMTIzMDAzMzAwMDQwNDkwMDAwMDAwNF0lMEFtb2R1bGUud2Vic2l0ZS1wb2QtdGVzdGVyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5yb2xlLXB5dGVzdC1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9d2Vic2l0ZS1wb2QtdGVzdGVyLTIwMjMxMTIzMTczNTMzODc1NDAwMDAwMDAxXSUwQW1vZHVsZS53ZWJzaXRlLXBvZC10ZXN0ZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnJvbGUtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXdlYnNpdGUtcG9kLXRlc3Rlci0yMDIzMTEyMzE3MzUzMzkyMzIwMDAwMDAwMl0lMEFtb2R1bGUud2Vic2l0ZS1wb2QtdGVzdGVyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5yb2xlLWFkbWluLXBlcm1pc3Npb25zWzBdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD13ZWJzaXRlLXBvZC10ZXN0ZXItMjAyMzExMjMxNzM1MzM5MzQ5MDAwMDAwMDRdJTBBbW9kdWxlLmluZnJhaG91c2Utb21uaWJ1cy1jYWNoZS5hd3NfczNfYnVja2V0X3BvbGljeS5wdWJsaWMtYWNjZXNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGVdJTBBYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LndlYnNpdGUtcG9kLXRlc3Rlci1zZXJuaXZlLW5ldHdvcmstcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXdlYnNpdGUtcG9kLXRlc3Rlci0yMDIzMTEyMzE3MzUzMzkyMzgwMDAwMDAwM10lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1naXRodWItMjAyMzA5MDgwMDQxMzg0NTk4MDAwMDAwMDFdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hZG1pbi1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTM1NzA1MzkxMjhdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5hd3NfaWFtX3JvbGUuYWRtaW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbl0lMEFhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQub21uaWJ1czogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9b21uaWJ1cy0yMDIzMDcyOTA0MjQzMjMyMzQwMDAwMDAwMl0lMEFtb2R1bGUuZWxhc3RpY3NlYXJjaC10ZXN0ZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnJvbGUtcHl0ZXN0LXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1lbGFzdGljc2VhcmNoLXRlc3Rlci0yMDI0MDIwNTE4NTMxMjAyMTcwMDAwMDAwN10lMEFtb2R1bGUuZWxhc3RpY3NlYXJjaC10ZXN0ZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnJvbGUtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWVsYXN0aWNzZWFyY2gtdGVzdGVyLTIwMjQwMjA1MTg1MzExOTE0MzAwMDAwMDA1XSUwQW1vZHVsZS5naXRodWItcm9sZS10ZXN0ZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnJvbGUtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdpdGh1Yi1yb2xlLXRlc3Rlci0yMDIzMTEwODAxMDgyMjc3MTgwMDAwMDAwMV0lMEFhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuZWxhc3RpY3NlYXJjaC10ZXN0ZXItc2VydmljZS1uZXR3b3JrLXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1lbGFzdGljc2VhcmNoLXRlc3Rlci0yMDI0MDIwNTE4NTMxMTkwODcwMDAwMDAwM10lMEFtb2R1bGUuZ2l0aHViLXJvbGUtdGVzdGVyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5yb2xlLXB5dGVzdC1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLXJvbGUtdGVzdGVyLTIwMjMxMTA4MDEwODIyODMwMDAwMDAwMDAzXSUwQW1vZHVsZS5lbGFzdGljc2VhcmNoLXRlc3Rlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQucm9sZS1hZG1pbi1wZXJtaXNzaW9uc1swXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ZWxhc3RpY3NlYXJjaC10ZXN0ZXItMjAyNDAyMDUxODUzMTIwMTY2MDAwMDAwMDZdJTBBYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmVsYXN0aWNzZWFyY2gtdGVzdGVyLXdlYnNpdGUtcG9kLXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1lbGFzdGljc2VhcmNoLXRlc3Rlci0yMDI0MDIwNTE4NTMxMTkwOTMwMDAwMDAwNF0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5hZG1pbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLTIwMjMwNzAyMTUyNzQ4NjQ2NDAwMDAwMDAxXSUwQW1vZHVsZS5kZWJpYW4tcmVwby10ZXN0ZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnJvbGUtcHl0ZXN0LXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1kZWJpYW4tcmVwby10ZXN0ZXItMjAyMzExMDkxNjEzNDU2OTI0MDAwMDAwMDRdJTBBbW9kdWxlLmRlYmlhbi1yZXBvLXRlc3Rlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQucm9sZS1hZG1pbi1wZXJtaXNzaW9uc1swXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ZGViaWFuLXJlcG8tdGVzdGVyLTIwMjQwMjIyMTkxNDU2NzYxMjAwMDAwMDAxXSUwQW1vZHVsZS5kZWJpYW4tcmVwby10ZXN0ZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnJvbGUtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWRlYmlhbi1yZXBvLXRlc3Rlci0yMDIzMTEwOTE2MTM0NTY5ODUwMDAwMDAwNV0lMEFtb2R1bGUucHlwaXNlcnZlci10ZXN0ZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnJvbGUtcHl0ZXN0LXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1weXBpc2VydmVyLXRlc3Rlci0yMDI0MDIyMDIwNTgyNTU3MzAwMDAwMDAwNV0lMEFtb2R1bGUucHlwaXNlcnZlci10ZXN0ZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnJvbGUtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXB5cGlzZXJ2ZXItdGVzdGVyLTIwMjQwMjIwMjA1ODI1NTcyMjAwMDAwMDA0XSUwQW1vZHVsZS5weXBpc2VydmVyLXRlc3Rlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQucm9sZS1hZG1pbi1wZXJtaXNzaW9uc1swXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cHlwaXNlcnZlci10ZXN0ZXItMjAyNDAyMjAyMDU4MjU1NjM2MDAwMDAwMDNdJTBBJTBBVGVycmFmb3JtIHVzZWQgdGhlIHNlbGVjdGVkIHByb3ZpZGVycyB0byBnZW5lcmF0ZSB0aGUgZm9sbG93aW5nIGV4ZWN1dGlvbiUwQXBsYW4uIFJlc291cmNlIGFjdGlvbnMgYXJlIGluZGljYXRlZCB3aXRoIHRoZSBmb2xsb3dpbmcgc3ltYm9sczolMEEgICsgY3JlYXRlJTBBICB+IHVwZGF0ZSBpbi1wbGFjZSUwQSUwQVRlcnJhZm9ybSB3aWxsIHBlcmZvcm0gdGhlIGZvbGxvd2luZyBhY3Rpb25zOiUwQSUwQSAgIyBhd3NfaWFtX3JvbGUub21uaWJ1cyB3aWxsIGJlIHVwZGF0ZWQgaW4tcGxhY2UlMEEgIH4gcmVzb3VyY2UgXCJhd3NfaWFtX3JvbGVcIiBcIm9tbmlidXNcIiB7JTBBICAgICAgfiBhc3N1bWVfcm9sZV9wb2xpY3kgICAgPSBqc29uZW5jb2RlKCUwQSAgICAgICAgICB+IHslMEEgICAgICAgICAgICAgIH4gU3RhdGVtZW50ID0gWyUwQSAgICAgICAgICAgICAgICAgIH4geyUwQSAgICAgICAgICAgICAgICAgICAgICB+IFByaW5jaXBhbCA9IHslMEEgICAgICAgICAgICAgICAgICAgICAgICAgIH4gQVdTID0gWyUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgXCJhcm46YXdzOmlhbTo6OTkwNDY2NzQ4MDQ1OnVzZXIvYWxla3NcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiQVJPQVhGWFpSTDI0RDVKWUc2SUJXXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6cm9sZS9pbmZyYWhvdXNlLXRvb2xraXQtZ2l0aHViXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICAgICAgICAgICB9JTBBICAgICAgICAgICAgICAgICAgICAgICAgIyAoMyB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pJTBBICAgICAgICAgICAgICAgICAgICB9LCUwQSAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICAgICMgKDEgdW5jaGFuZ2VkIGF0dHJpYnV0ZSBoaWRkZW4pJTBBICAgICAgICAgICAgfSUwQSAgICAgICAgKSUwQSAgICAgICAgaWQgICAgICAgICAgICAgICAgICAgID0gXCJvbW5pYnVzXCIlMEEgICAgICAgIG5hbWUgICAgICAgICAgICAgICAgICA9IFwib21uaWJ1c1wiJTBBICAgICAgICB0YWdzICAgICAgICAgICAgICAgICAgPSB7fSUwQSAgICAgICAgIyAoOSB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmNsb3VkLWluaXQtdGVzdGVyLmF3c19pYW1fcG9saWN5LnB5dGVzdC1wZXJtaXNzaW9ucyB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfaWFtX3BvbGljeVwiIFwicHl0ZXN0LXBlcm1pc3Npb25zXCIgeyUwQSAgICAgICsgYXJuICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpZCAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG5hbWUgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbmFtZV9wcmVmaXggPSBcInB5dGVzdC1wZXJtaXNzaW9uc1wiJTBBICAgICAgKyBwYXRoICAgICAgICA9IFwiL1wiJTBBICAgICAgKyBwb2xpY3kgICAgICA9IGpzb25lbmNvZGUoJTBBICAgICAgICAgICAgeyUwQSAgICAgICAgICAgICAgKyBTdGF0ZW1lbnQgPSBbJTBBICAgICAgICAgICAgICAgICAgKyB7JTBBICAgICAgICAgICAgICAgICAgICAgICsgQWN0aW9uICAgPSBbJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiczM6UHV0QnVja2V0VGFnZ2luZ1wiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcInMzOkdldEJ1Y2tldFRhZ2dpbmdcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJpYW06VGFnUm9sZVwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImlhbTpUYWdQb2xpY3lcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJlYzI6RGVzY3JpYmVSZWdpb25zXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiZHluYW1vZGI6VGFnUmVzb3VyY2VcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJkeW5hbW9kYjpMaXN0VGFnc09mUmVzb3VyY2VcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgPSBcIkFsbG93XCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBSZXNvdXJjZSA9IFwiKlwiJTBBICAgICAgICAgICAgICAgICAgICB9LCUwQSAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICArIFZlcnNpb24gICA9IFwiMjAxMi0xMC0xN1wiJTBBICAgICAgICAgICAgfSUwQSAgICAgICAgKSUwQSAgICAgICsgcG9saWN5X2lkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB0YWdzX2FsbCAgICA9IHslMEEgICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIiUwQSAgICAgICAgfSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5jbG91ZC1pbml0LXRlc3Rlci5hd3NfaWFtX3BvbGljeS5yb2xlLXBlcm1pc3Npb25zIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19pYW1fcG9saWN5XCIgXCJyb2xlLXBlcm1pc3Npb25zXCIgeyUwQSAgICAgICsgYXJuICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpZCAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG5hbWUgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbmFtZV9wcmVmaXggPSBcImNsb3VkLWluaXQtdGVzdGVyLXBlcm1pc3Npb25zXCIlMEEgICAgICArIHBhdGggICAgICAgID0gXCIvXCIlMEEgICAgICArIHBvbGljeSAgICAgID0ganNvbmVuY29kZSglMEEgICAgICAgICAgICB7JTBBICAgICAgICAgICAgICArIFN0YXRlbWVudCA9IFslMEEgICAgICAgICAgICAgICAgICArIHslMEEgICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICA9IFwic3RzOkdldENhbGxlcklkZW50aXR5XCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICA9IFwiQWxsb3dcIiUwQSAgICAgICAgICAgICAgICAgICAgICArIFJlc291cmNlID0gXCIqXCIlMEEgICAgICAgICAgICAgICAgICAgIH0sJTBBICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICsgVmVyc2lvbiAgID0gXCIyMDEyLTEwLTE3XCIlMEEgICAgICAgICAgICB9JTBBICAgICAgICApJTBBICAgICAgKyBwb2xpY3lfaWQgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHRhZ3NfYWxsICAgID0geyUwQSAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiJTBBICAgICAgICB9JTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmNsb3VkLWluaXQtdGVzdGVyLmF3c19pYW1fcm9sZS5yb2xlLXRlc3RlciB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfaWFtX3JvbGVcIiBcInJvbGUtdGVzdGVyXCIgeyUwQSAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgYXNzdW1lX3JvbGVfcG9saWN5ICAgID0ganNvbmVuY29kZSglMEEgICAgICAgICAgICB7JTBBICAgICAgICAgICAgICArIFN0YXRlbWVudCA9IFslMEEgICAgICAgICAgICAgICAgICArIHslMEEgICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICAgPSBcInN0czpBc3N1bWVSb2xlXCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICAgPSBcIkFsbG93XCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBQcmluY2lwYWwgPSB7JTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIEFXUyA9IFwiYXJuOmF3czppYW06Ojk5MDQ2Njc0ODA0NTp1c2VyL2FsZWtzXCIlMEEgICAgICAgICAgICAgICAgICAgICAgICB9JTBBICAgICAgICAgICAgICAgICAgICB9LCUwQSAgICAgICAgICAgICAgICAgICsgeyUwQSAgICAgICAgICAgICAgICAgICAgICArIEFjdGlvbiAgICA9IFwic3RzOkFzc3VtZVJvbGVXaXRoV2ViSWRlbnRpdHlcIiUwQSAgICAgICAgICAgICAgICAgICAgICArIENvbmRpdGlvbiA9IHslMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgU3RyaW5nRXF1YWxzID0geyUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJ0b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbTphdWRcIiA9IFwic3RzLmFtYXpvbmF3cy5jb21cIiUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgICB9JTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFN0cmluZ0xpa2UgICA9IHslMEEgICAgICAgICAgICAgICAgICAgICAgICAgICAgICArIFwidG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb206c3ViXCIgPSBcInJlcG86aW5mcmFob3VzZS90ZXJyYWZvcm0tYXdzLWNsb3VkLWluaXQ6KlwiJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAgIH0lMEEgICAgICAgICAgICAgICAgICAgICAgICB9JTBBICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgID0gXCJBbGxvd1wiJTBBICAgICAgICAgICAgICAgICAgICAgICsgUHJpbmNpcGFsID0geyUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgKyBGZWRlcmF0ZWQgPSBcImFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbVwiJTBBICAgICAgICAgICAgICAgICAgICAgICAgfSUwQSAgICAgICAgICAgICAgICAgICAgfSwlMEEgICAgICAgICAgICAgICAgXSUwQSAgICAgICAgICAgICAgKyBWZXJzaW9uICAgPSBcIjIwMTItMTAtMTdcIiUwQSAgICAgICAgICAgIH0lMEEgICAgICAgICklMEEgICAgICArIGNyZWF0ZV9kYXRlICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGRlc2NyaXB0aW9uICAgICAgICAgICA9IFwiUm9sZSB0byB0ZXN0IG1vZHVsZSBpbmZyYWhvdXNlL3RlcnJhZm9ybS1hd3MtY2xvdWQtaW5pdFwiJTBBICAgICAgKyBmb3JjZV9kZXRhY2hfcG9saWNpZXMgPSBmYWxzZSUwQSAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbWFuYWdlZF9wb2xpY3lfYXJucyAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbWF4X3Nlc3Npb25fZHVyYXRpb24gID0gMzYwMCUwQSAgICAgICsgbmFtZSAgICAgICAgICAgICAgICAgID0gXCJjbG91ZC1pbml0LXRlc3RlclwiJTBBICAgICAgKyBuYW1lX3ByZWZpeCAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwYXRoICAgICAgICAgICAgICAgICAgPSBcIi9cIiUwQSAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiJTBBICAgICAgICB9JTBBICAgICAgKyB1bmlxdWVfaWQgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmNsb3VkLWluaXQtdGVzdGVyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5yb2xlLXBlcm1pc3Npb25zIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudFwiIFwicm9sZS1wZXJtaXNzaW9uc1wiIHslMEEgICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwb2xpY3lfYXJuID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcm9sZSAgICAgICA9IFwiY2xvdWQtaW5pdC10ZXN0ZXJcIiUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5jbG91ZC1pbml0LXRlc3Rlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQucm9sZS1weXRlc3QtcGVybWlzc2lvbnMgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50XCIgXCJyb2xlLXB5dGVzdC1wZXJtaXNzaW9uc1wiIHslMEEgICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwb2xpY3lfYXJuID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcm9sZSAgICAgICA9IFwiY2xvdWQtaW5pdC10ZXN0ZXJcIiUwQSAgICB9JTBBJTBBUGxhbjogNSB0byBhZGQsIDEgdG8gY2hhbmdlLCAwIHRvIGRlc3Ryb3kuJTBBJTBBXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwJTBBJTBBU2F2ZWQgdGhlIHBsYW4gdG86IHRmLnBsYW4lMEElMEFUbyBwZXJmb3JtIGV4YWN0bHkgdGhlc2UgYWN0aW9ucywgcnVuIHRoZSBmb2xsb3dpbmcgY29tbWFuZCB0byBhcHBseTolMEEgICAgdGVycmFmb3JtIGFwcGx5IFwidGYucGxhblwiJTBBXG46OmRlYnVnOjpzdGRlcnI6IFxuOjpkZWJ1Zzo6ZXhpdGNvZGU6IDAiLCAic3RkZXJyIjogIiIsICJhZGQiOiA1LCAiY2hhbmdlIjogMSwgImRlc3Ryb3kiOiAwfX0=```
</p></details>